# Piping

Libraries and other essestials thing before we start

In [27]:
from dfply import *
import seaborn as sns

In [28]:
cars = sns.load_dataset('mpg')

### Exercise 1.
Select the columns ‘mpg’ and ‘horsepower’ from the cars DataFrame.

In [29]:
cars >> select(cars.mpg, cars.horsepower) >> head(5)

    mpg  horsepower
0  18.0       130.0
1  15.0       165.0
2  18.0       150.0
3  16.0       150.0
4  17.0       140.0

### Exercise 2.
Select the columns ‘mpg’ and ‘horsepower’ from the cars DataFrame using the drop function.

In [30]:
cars >> drop(cars.cylinders, cars.displacement, cars.weight, cars.acceleration, cars.model_year, cars.name, cars.origin) >> head(5)

    mpg  horsepower
0  18.0       130.0
1  15.0       165.0
2  18.0       150.0
3  16.0       150.0
4  17.0       140.0

### Exercise 3.
Select all columns except ‘model_year’, and ‘name’ from the cars DataFrame.

In [31]:
cars >> select(~cars.model_year, ~cars.name) >> head(5)

TypeError: bad operand type for unary ~: 'str'

### Exercise 4.
The selection filter functions are best explained by example. Let’s say I wanted to select only the columns that started with a “c”:

In [ ]:
cars >> select(starts_with('c')) >> head(5)

   cylinders
0          8
1          8
2          8
3          8
4          8

### Exercise 5.
Select the columns that contain the substring “e” from the cars DataFrame.

In [ ]:
cars >> select(contains('e')) >> head(5)

,cylinders,displacement,horsepower,weight,acceleration,model_year,name
0,8,307.0,130.0,3504,12.0,70,chevrolet chevelle malibu
1,8,350.0,165.0,3693,11.5,70,buick skylark 320
2,8,318.0,150.0,3436,11.0,70,plymouth satellite
3,8,304.0,150.0,3433,12.0,70,amc rebel sst
4,8,302.0,140.0,3449,10.5,70,ford torino

### Exercise 6.
Select the columns that are between ‘mpg’ and ‘origin’ from the cars DataFrame.

In [ ]:
cars >> select(columns_between('mpg', 'origin')) >> head(5)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin
0,18.0,8,307.0,130.0,3504,12.0,70,usa
1,15.0,8,350.0,165.0,3693,11.5,70,usa
2,18.0,8,318.0,150.0,3436,11.0,70,usa
3,16.0,8,304.0,150.0,3433,12.0,70,usa
4,17.0,8,302.0,140.0,3449,10.5,70,usa

### Exercise 7.
Select the first three rows from the cars DataFrame.

In [33]:
cars >> row_slice([0,1,2])

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite

### Exercise 8.
Select the unique rows from the ‘origin’ column in the cars DataFrame.

In [35]:
cars >> distinct(cars.origin)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
14,24.0,4,113.0,95.0,2372,15.0,70,japan,toyota corona mark ii
19,26.0,4,97.0,46.0,1835,20.5,70,europe,volkswagen 1131 deluxe sedan

### Exercise 9.
Filter the cars DataFrame to only include rows where the ‘mpg’ is greater than 20, origin Japan, and display the first three rows

In [ ]:
cars >> mask()

### Exercise 10.
Extract the ‘mpg’ column from the cars DataFrame, japanese origin, model year 70s, and display the first three rows.

### Exercise 11.
Create a new column ‘mpg_per_cylinder’ in the cars DataFrame that is the result of dividing the ‘mpg’ column by the ‘cylinders’ column.

### Exercise 12.
Create a new column ‘mpg_per_cylinder’ in the cars DataFrame that is the result of dividing the ‘mpg’ column by the ‘cylinders’ column, and display only the new column.

### Exercise 13.
Group the cars DataFrame by the ‘origin’ column and calculate the lead of the ‘mpg’ column.

### Exercise 14.
Sort the cars DataFrame by the ‘mpg’ column in descending order.

### Exercise 15.
Rename the ‘mpg’ column to ‘miles_per_gallon’ in the cars DataFrame.

### Exercise 16.
Reshape the cars DataFrame from wide to long format by gathering the columns ‘mpg’, ‘horsepower’, ‘weight’, ‘acceleration’, and ‘displacement’ into a new column ‘variable’ and their values into a new column ‘value’.

### Exercise 17.
Reshape the cars DataFrame from long to wide format by spreading the ‘variable’ column into columns and their values into the ‘value’ column.

### Exercise 18.
Calculate the mean ‘mpg’ for each group of ‘origin’ in the cars DataFrame.

### Exercise 19. 
Calculate the mean ‘mpg’ and ‘horsepower’ for each group of ‘origin’ in the cars DataFrame.

### Exercise 20.
Calculate the mean ‘mpg’ for each group of ‘origin’ and ‘model_year’ in the cars DataFrame.